controllers/ApiAgentController.php

UPDATE `env` SET `status`=2 WHERE `id`=18
---
    public function actionUpdateStatus() {
        $hostname = $this->getParams('hostname');
        $uname = $this->getParams('uname');
        $status = $this->getParams('status');
        $row = Env::find()->where(['hostname'=>$hostname, 'branch_name'=>$uname])->one();
        $row->status = $status;
        $ret = $row->save(false);//update