controllers/TpconfigController.php

INSERT INTO `tpconfig` (`tp_name`, `order_type`, `token`, `detail`) VALUES ('周黑鸭', 3012, '09f6fc1e7f2f2cc057e23fb30104a861b31a76fd', '{\"tokeninfo\":\"\\u5468\\u9ed1\\u9e2d10063012\"}')
---
    public function actionCreate()
    {
        $model = new Tpconfig();
	$post = $this->getPostWithToken();
	if ($model->load($post) && $model->save()) {

SELECT * FROM `tpconfig` WHERE `id`='10'
---
    protected function findModel($id)
    {
        if (($model = Tpconfig::findOne($id)) !== null) {